Assemcorp/PY32F072_Keil_Template/Drivers/PY32F072C_HAL_Driver/Inc/py32f072c_hal_can.h
/** @defgroup CAN_filter_channel CAN Acceptance Channel
  * @{
  */
#define CAN_FILTER_CHANNEL_0           (0x00000000U)
#define CAN_FILTER_CHANNEL_1           (0x00000001U)
#define CAN_FILTER_CHANNEL_2           (0x00000002U)
#define CAN_FILTER_CHANNEL_3           (0x00000003U)
#define CAN_FILTER_CHANNEL_4           (0x00000004U)
#define CAN_FILTER_CHANNEL_5           (0x00000005U)
#define CAN_FILTER_CHANNEL_6           (0x00000006U)
#define CAN_FILTER_CHANNEL_7           (0x00000007U)
#define CAN_FILTER_CHANNEL_8           (0x00000008U)
#define CAN_FILTER_CHANNEL_9           (0x00000009U)
#define CAN_FILTER_CHANNEL_10          (0x0000000AU)
#define CAN_FILTER_CHANNEL_11          (0x0000000BU)
/**
 * @}
 */

/** @defgroup CAN_filter_rank CAN Filter rank
  * @{
  */
#define CAN_FILTER_RANK_CHANNEL_NUMBER (0x00000000U)  /*!< Enable the rank of the selected channels.  */
#define CAN_FILTER_RANK_NONE           (0x00000001U)  /*!< Disable the selected rank (selected channel).  */
/**
  * @}
  */

/** @defgroup CAN_RX_FIFO_overflow_mode CAN Receive Buffer Overflow Mode
  * @{
  */
#define CAN_RX_FIFO_OVERWRITE          (0x00000000U)    /*!< Rx FIFO overwrite mode */
#define CAN_RX_FIFO_BLOCKING           (CAN_MCR_ROM)   /*!< Rx FIFO blocking mode  */
/**
  * @}
  */

/**
 * @defgroup CAN_receive_fifo_state CAN Receive Buffer status
 * @{
 */
#define CAN_RX_FIFO_EMPTY                    (0x00000000U)                           /*!< Rx FIFO empty  */
#define CAN_RX_FIFO_LE_AFWL                  (CAN_MCR_RSTAT_0)                     /*!< Rx FIFO more than empty and less than almost full (AFWL) */
#define CAN_RX_FIFO_GT_AFWL                  (CAN_MCR_RSTAT_1)                     /*!< Rx FIFO Greater than or equal to almost full */
#define CAN_RX_FIFO_FULL                     (CAN_MCR_RSTAT_0 | CAN_MCR_RSTAT_1) /*!< Rx FIFO full */
/**
 * @}
 */

/**
 * @defgroup CAN_transmit_fifo_state CAN Transmit Buffer status
 * @{
 */
#define CAN_STB_FIFO_EMPTY                  (0x00000000U)   /*!< STB FIFO empty  */
#define CAN_STB_FIFO_LE_HF                  (CAN_MCR_TSSTAT_0)   /*!< STB FIFO less than or equal to half full */
#define CAN_STB_FIFO_GT_HF                  (CAN_MCR_TSSTAT_1)   /*!< STB FIFO More than half full */
#define CAN_STB_FIFO_FULL                   (CAN_MCR_TSSTAT_0 | CAN_MCR_TSSTAT_1)   /*!< STB FIFO full */
/**
 * @}
 */

/**
 * @defgroup CAN_fifo_type CAN Transmit FIFO type
 * @{
 */
#define CAN_TX_FIFO_PTB                     (0x0U)
#define CAN_TX_FIFO_STB                     (0x1U)
/**
 * @}
 */

/**
 * @defgroup CAN_STB_priority_mode CAN STB Priority Mode
 * @{
 */
#define CAN_STB_PRIORITY_FIFO               (0x0U)                  /*!< Data first in and first be transmitted. */
#define CAN_STB_PRIORITY_ID                 (CAN_MCR_TSMODE)      /*!< Data with smallest ID first be transmitted. */
/**
 * @}
 */

/**
 * @defgroup CAN_transmit_status CAN Tx Frame status
 * @{
 */
#define CAN_TRANSMIT_STATUS_IDLE               (0x00000000U)                  /*!< No transmission in progress. */
#define CAN_TRANSMIT_STATUS_ONGOING            (0x00000001U)                  /*!< Transmission active without any issues. */
#define CAN_TRANSMIT_STATUS_LOST_ARBITRATION   (0x00000002U)                  /*!< Arbitration lost. re-arbitration may take place with respect to REALIM. */
#define CAN_TRANSMIT_STATUS_TRANSMITTED        (0x00000003U)                  /*!< Transmission successfully completed. */
#define CAN_TRANSMIT_STATUS_ABORTED            (0x00000004U)                  /*!< Transmission aborted (TPA, TSA). */
#define CAN_TRANSMIT_STATUS_DISTURBED          (0x00000005U)                  /*!< Transmission error. Retransmission may take place with respect to RETLIM. */
#define CAN_TRANSMIT_STATUS_REJECTED           (0x00000006U)                  /*!< Misconfiguration of the frame format in the LLC frame. */
/**
 * @}
 */
 
/**
 * @defgroup CAN_TT_trigger_type TTCAN Trigger Type
 * @{
 */
#define CAN_TT_IMMEDIATE_TRIGGER        (0x0U)
#define CAN_TT_RX_TIME_TRIG             (CAN_TTCR_TTYPE_0)
#define CAN_TT_TX_SINGLE_TRIG           (CAN_TTCR_TTYPE_1)
#define CAN_TT_TX_START_TRIG            (CAN_TTCR_TTYPE_0 | CAN_TTCR_TTYPE_1)
#define CAN_TT_TX_STOP_TRIG             (CAN_TTCR_TTYPE_2)
/**
 * @}
 */

/**
 * @defgroup CAN_TTCAN_FIFO_mode TTCAN FIFO mode
 * @{
 */
#define CAN_TT_FIFO_PTB_STB           (0x0U)
#define CAN_TT_FIFO_MERGE             (CAN_MCR_TTTBM)
/**
 * @}
 */

/**
 * @defgroup CAN_TT_FIFO_INDEX TTCAN FIFO index
 * @{
 */
#define CAN_TT_FIFO_SLOT0             (0x00000000U)
#define CAN_TT_FIFO_SLOT1             (0x00000001U)
#define CAN_TT_FIFO_SLOT2             (0x00000002U)
#define CAN_TT_FIFO_SLOT3             (0x00000003U)
/**
 * @}
 */

/**
 * @defgroup CAN_TT_FIFO_State_Set TTCAN FIFO State Set
 * @{
 */
#define CAN_TT_FIFO_SLOT_SET_EMPTY    (CAN_TTCR_TBE)
#define CAN_TT_FIFO_SLOT_SET_FULL     (CAN_TTCR_TBF)
/**
 * @}
 */
 
/** @defgroup CAN_timestamp_prescaler CAN timestamp prescaler
  * @{
  */
#define CAN_TT_PRESC_1                ((uint32_t)0x00000000U)                       /*!< Timestamp counter time unit in equal to CAN bit time                 */
#define CAN_TT_PRESC_2                (CAN_TTCR_T_PRESC_0)                        /*!< Timestamp counter time unit in equal to CAN bit time multiplied by 2  */
#define CAN_TT_PRESC_4                (CAN_TTCR_T_PRESC_1)                        /*!< Timestamp counter time unit in equal to CAN bit time multiplied by 4  */
#define CAN_TT_PRESC_8                (CAN_TTCR_T_PRESC_0 |CAN_TTCR_T_PRESC_1)  /*!< Timestamp counter time unit in equal to CAN bit time multiplied by 8  */
/**
  * @}
  */

/** @defgroup CAN_flags CAN Flags
  * @{
  */
#define CAN_FLAG_TX_STB_COMPLETE             CAN_IFR_TSIF             /*!< STB Transmission Completed   */
#define CAN_FLAG_TX_PTB_COMPLETE             CAN_IFR_TPIF             /*!< PTB Transmission Completed   */
#define CAN_FLAG_TX_ABORT_COMPLETE           CAN_IFR_AIF              /*!< Transmission Cancellation Finished */
#define CAN_FLAG_RX_COMPLETE                 CAN_IFR_RIF              /*!< Rx Completed   */
#define CAN_FLAG_RX_FIFO_ALMOST_FULL         CAN_IFR_RAFIF            /*!< Rx FIFO almost full */
#define CAN_FLAG_RX_FIFO_FULL                CAN_IFR_RFIF             /*!< Rx FIFO full */
#define CAN_FLAG_RX_FIFO_OVERFLOW            CAN_IFR_ROIF             /*!< Overflow of CAN Rx FIFO   */
#define CAN_FLAG_ARB_LOST                    CAN_IFR_ALIF             /*!< Arbitration lost detected   */
#define CAN_FLAG_ERROR_PASSIVE               CAN_IFR_EPIF             /*!< Error_Passive status changed  */
#define CAN_FLAG_BUS_ERROR                   CAN_IFR_BEIF             /*!< Bus_Off status changed       */
#define CAN_FLAG_ERROR_TOGGLE                CAN_IFR_EIF              /*!< Bus_Off status changed or Error_Passive status changed    */
#define CAN_FLAG_TRIGGER_COMPLETE            CAN_IFR_TTIF             /*!< Trigger Interrupt flag   */
#define CAN_FLAG_TRIGGER_ERROR               CAN_IFR_TEIF             /*!< Trigger error Interrupt flag   */
#define CAN_FLAG_TIMESTAMP_WRAPAROUND        CAN_IFR_WTIF             /*!< Timestamp counter wrapped around */

